import { Injectable } from '@angular/core';

@Injectable({
    providedIn : 'root'
})

export class StorageService  {
    public hiddenAlert : boolean = true;
    public hiddenAlert2 : boolean = false;
    public title : string = 'this-lesson';
    public newTitle : string = '';
    public lesson : string = 'lesson';
    public webToken : any;

    public arrayForInfo : Array<any> = [
        {
            colorTheme : '#DD0031',
            modalTitle  : 'ANGULAR 9',
            modalTextColor : '#DD0031',
            modalWarning : 'Հարգելի դիմորդ տվյալ դասընթացին մասնակցելու և այն բարեհաջող' + '\n' +
            'ավարտելու համար անհրաժեշտ է ալգորիթմիկ մտածելակերպ,միջին մակարդակի անգլերենի' 
            + '\n' +
            'և տվյալ տեխնոլոգիաների պարտադիր իմացություն ՝ ' + '\n' + 
            ' "HTML5,CSS3,Bootstrap4,JavaScript(ES5/ES6),JS OOP,JS DOM,Jquery" : Հարգելի դիմորդ նշենք,որ' 
            + '\n' + 
            'տվյալ տեխնոլոգիաների իմացության դեպքում դասընթացին գրանցվելուց հետո,որոշ ժամանակ անց' 
            + '\n' +
            'կստանաք հրավեր մեր It-School թիմի կողմից համապատասխան թեստավորումն անցնելու համար,' 
            + '\n' +
            'որից հետո արդեն պարզ կդառնա ձեր մասնակցությունը տվյալ դասընթացին,սիրով It-School:',
            title : 'Angular',
            src : '../../../assets/Images/angular-logo.png',
            bgColor : '#F8D7DA',
            buttonColor : 'rgb(255,8,0)',
            token : Math.floor(Math.random() * 100000),
            info : `Հարգելի դիմորդ դուք հաջողությամբ գրանցվել եք տվյալ դասընթացին,կխնդրենք ձեզ սպասել 
            մեր զանգին,որպեսզի նախապես պայմանավորվենք ձեր քննության համար,որը բարեհաջող հանձնելու 
            դեպքում դուք կկարողանաք մասնակցել դասընթացին:Դասընթացին ձեզ կտրվի առանձին համակարգիչ 
            և իհարկե անհատական մոտեցում ջերմ մթնոլորտում:Դասընթացի ավարտից հետո ձեզ կտրվի սերտիֆիկատ
            A կամ B մակարդակի,ինչպես նաև անպայման կունենաք անվճար պրակտիկայի հնարավորություն մեր 
            հանրապետության առաջատար SS ընկերություններում,որից հետո կստանաք աշխատանքի առաջարկ,
            որպես Angular developer:Մենք ապահովում ենք մեր ջանասեր ուսանողներին որակյալ կրթությամբ 
            և հուսալի ապագայով:Վարձավճարը կազմում է ամսեկան 60.000 դրամ:Դասընթացի տևողությունը
            3 ամիս:`,
            teacher : 'Սևակ Մխիթարյան,Angular developer Synergy International Systems-ում:',
            date : 'Դասընթացը կմեկնարկվի 2 ամսից.'
        },
        {
            colorTheme : '#00D8FF',
            modalTitle  : 'REACT/REDUX',
            modalTextColor : '#00D8FF',
            modalWarning : 'Հարգելի դիմորդ տվյալ դասընթացին մասնակցելու և այն բարեհաջող' 
            + '\n' +
            'ավարտելու համար անհրաժեշտ է ալգորիթմիկ մտածելակերպ,միջին մակարդակի անգլերենի' 
            + '\n' +
            'և տվյալ տեխնոլոգիաների պարտադիր իմացություն ՝ ' + '\n' + 
            ' "HTML5,CSS3,Bootstrap4,JavaScript(ES5/ES6),JS OOP,JS DOM,Jquery" : Հարգելի դիմորդ նշենք,որ' 
            + '\n' + 
            'տվյալ տեխնոլոգիաների իմացության դեպքում դասընթացին գրանցվելուց հետո,որոշ ժամանակ անց'
             + '\n' +
            'կստանաք հրավեր մեր It-School թիմի կողմից համապատասխան թեստավորումն անցնելու համար,' 
            + '\n' +
            'որից հետո արդեն պարզ կդառնա ձեր մասնակցությունը տվյալ դասընթացին,սիրով It-School:',
            title : 'React-Redux',
            src : '../../../assets/Images/react-logo.png',
            bgColor : '#D1ECF1',
            buttonColor : 'rgb(15,192,252)',
            token : Math.floor(Math.random() * 100000),
            info : `Հարգելի դիմորդ դուք հաջողությամբ գրանցվել եք տվյալ դասընթացին,կխնդրենք ձեզ սպասել 
            մեր զանգին,որպեսզի նախապես պայմանավորվենք ձեր քննության համար,որը բարեհաջող հանձնելու 
            դեպքում դուք կկարողանաք մասնակցել դասընթացին:Դասընթացին ձեզ կտրվի առանձին համակարգիչ 
            և իհարկե անհատական մոտեցում ջերմ մթնոլորտում:Դասընթացի ավարտից հետո ձեզ կտրվի սերտիֆիկատ
            A կամ B մակարդակի,ինչպես նաև անպայման կունենաք անվճար պրակտիկայի հնարավորություն մեր 
            հանրապետության առաջատար SS ընկերություններում,որից հետո կստանաք աշխատանքի առաջարկ,
            որպես React developer:Մենք ապահովում ենք մեր ջանասեր ուսանողներին որակյալ կրթությամբ 
            և հուսալի ապագայով:Վարձավճարը կազմում է ամսեկան 60.000 դրամ:Դասընթացի տևողությունը
            3 ամիս:`,
            teacher : 'Նարեկ Մկրտչյան,ReactJS developer BetConstract-ում:',
            date : 'Դասընթացը կմեկնարկվի 2 ամսից.'
        },
        {
            colorTheme : '#90C53F',
            modalTitle  : 'NODE.js',
            modalTextColor : '#90C53F',
            modalWarning : 'Հարգելի դիմորդ տվյալ դասընթացին մասնակցելու և այն բարեհաջող' 
            + '\n' +
            'ավարտելու համար անհրաժեշտ է ալգորիթմիկ մտածելակերպ,տեխնիկական կրթություն,' 
            + '\n' + 
            'միջին մակարդակի անգլերենի և տվյալ տեխնոլոգիաների պարտադիր իմացություն ՝ ' 
            + '\n' + 
            ' "HTML5,JavaScript(ES5/ES6),JS OOP" : Հարգելի դիմորդ նշենք,որ' + '\n' + 
            'տվյալ տեխնոլոգիաների իմացության դեպքում դասընթացին գրանցվելուց հետո,որոշ ժամանակ անց' 
            + '\n' +
            'կստանաք հրավեր մեր It-School թիմի կողմից համապատասխան թեստավորումն անցնելու համար,' 
            + '\n' +
            'որից հետո արդեն պարզ կդառնա ձեր մասնակցությունը տվյալ դասընթացին,սիրով It-School:',
            title : 'Node.js',
            src : '../../../assets/Images/node-logo.png',
            bgColor : '#D4EDDA',
            buttonColor : 'rgb(0,255,0)',
            token : Math.floor(Math.random() * 100000),
            info : `Հարգելի դիմորդ դուք հաջողությամբ գրանցվել եք տվյալ դասընթացին,կխնդրենք ձեզ սպասել 
            մեր զանգին,որպեսզի նախապես պայմանավորվենք ձեր քննության համար,որը բարեհաջող հանձնելու 
            դեպքում դուք կկարողանաք մասնակցել դասընթացին:Դասընթացին ձեզ կտրվի առանձին համակարգիչ 
            և իհարկե անհատական մոտեցում ջերմ մթնոլորտում:Դասընթացի ավարտից հետո ձեզ կտրվի սերտիֆիկատ
            A կամ B մակարդակի,ինչպես նաև անպայման կունենաք անվճար պրակտիկայի հնարավորություն մեր 
            հանրապետության առաջատար SS ընկերություններում,որից հետո կստանաք աշխատանքի առաջարկ,
            որպես Node.js developer:Մենք ապահովում ենք մեր ջանասեր ուսանողներին որակյալ կրթությամբ 
            և հուսալի ապագայով:Վարձավճարը կազմում է ամսեկան 60.000 դրամ:Դասընթացի տևողությունը
            4 ամիս:`,
            teacher : 'Արսեն Մովսիսյան,Full-Stack JavaScript developer Workfront Armenia-յում:',
            date : 'Դասընթացը կմեկնարկվի 2 ամսից.'
        },
        {
            colorTheme : '#FFD242',
            modalTitle  : 'PYTHON',
            modalTextColor : '#3771A1',
            modalWarning : 'Հարգելի դիմորդ տվյալ դասընթացին մասնակցելու և այն բարեհաջող' + '\n' +
            'ավարտելու համար անհրաժեշտ է ալգորիթմիկ մտածելակերպ,միջին մակարդակի անգլերենի իմացություն,'
             + '\n' +
            'տեխնիկական կրթություն,մաթեմատիկական խորը գիտելիքները կդիտվեն,որպես առավելություն մյուս' 
            + '\n' + 
            'դիմորդների նկատմամբ,սիրով It-School:',
            title : 'Python',
            src : '../../../assets/Images/python-logo.png',
            bgColor : '#FFF3CD',
            buttonColor : 'rgb(255,219,0)',
            token : Math.floor(Math.random() * 100000),
            info : `Հարգելի դիմորդ դուք հաջողությամբ գրանցվել եք տվյալ դասընթացին:Դասընթացին ձեզ կտրվի 
            առանձին համակարգիչ և իհարկե անհատական մոտեցում ջերմ մթնոլորտում:Դասընթացի ավարտից հետո 
            ձեզ կտրվի սերտիֆիկատ A կամ B մակարդակի,ինչպես նաև անպայման կունենաք անվճար պրակտիկայի 
            հնարավորություն մեր հանրապետության առաջատար SS ընկերություններում,որից հետո կստանաք աշխատանքի
            առաջարկ,որպես Python developer:Մենք ապահովում ենք մեր ջանասեր ուսանողներին որակյալ կրթությամբ 
            և հուսալի ապագայով:Վարձավճարը կազմում է ամսեկան 60.000 դրամ:Դասընթացի տևողությունը
            4 ամիս:`,
            teacher : 'Մարգարյան Հովհաննես,Senior Software Engineer Webb Fontaine-ում:',
            date : 'Դասընթացը կմեկնարկվի 1 ամսից.'
        },
        {
            colorTheme : '#4FC08D',
            modalTitle  : 'VUE.js',
            modalTextColor : '#4FC08D',
            modalWarning : 'Հարգելի դիմորդ տվյալ դասընթացին մասնակցելու և այն բարեհաջող' 
            + '\n' +
            'ավարտելու համար անհրաժեշտ է ալգորիթմիկ մտածելակերպ,միջին մակարդակի անգլերենի' 
            + '\n' +
            'և տվյալ տեխնոլոգիաների պարտադիր իմացություն ՝ ' + '\n' + 
            ' "HTML5,CSS3,Bootstrap4,JavaScript(ES5/ES6),JS OOP,JS DOM" : Հարգելի դիմորդ նշենք,որ' 
            + '\n' + 
            'տվյալ տեխնոլոգիաների իմացության դեպքում դասընթացին գրանցվելուց հետո,որոշ ժամանակ անց' 
            + '\n' +
            'կստանաք հրավեր մեր It-School թիմի կողմից համապատասխան թեստավորումն անցնելու համար,' 
            + '\n' +
            'որից հետո արդեն պարզ կդառնա ձեր մասնակցությունը տվյալ դասընթացին,սիրով It-School:',
            title : 'Vue.js',
            src : '../../../assets/Images/vue-logo.png',
            bgColor : '#D4EDDA',
            buttonColor : 'rgb(102,221,170)',
            token : Math.floor(Math.random() * 100000),
            info : `Հարգելի դիմորդ դուք հաջողությամբ գրանցվել եք տվյալ դասընթացին,կխնդրենք ձեզ սպասել 
            մեր զանգին,որպեսզի նախապես պայմանավորվենք ձեր քննության համար,որը բարեհաջող հանձնելու 
            դեպքում դուք կկարողանաք մասնակցել դասընթացին:Դասընթացին ձեզ կտրվի առանձին համակարգիչ 
            և իհարկե անհատական մոտեցում ջերմ մթնոլորտում:Դասընթացի ավարտից հետո ձեզ կտրվի սերտիֆիկատ
            A կամ B մակարդակի,ինչպես նաև անպայման կունենաք անվճար պրակտիկայի հնարավորություն մեր 
            հանրապետության առաջատար SS ընկերություններում,որից հետո կստանաք աշխատանքի առաջարկ,
            որպես Vue.js developer:Մենք ապահովում ենք մեր ջանասեր ուսանողներին որակյալ կրթությամբ 
            և հուսալի ապագայով:Վարձավճարը կազմում է ամսեկան 60.000 դրամ:Դասընթացի տևողությունը
            2 ամիս:`,
            teacher : 'Ստեփան Սարգսյան,Vue.js developer Digitain Armenia-յում:',
            date : 'Դասընթացը կմեկնարկվի 3 ամսից.'
        },
        {
            colorTheme : '#5382a1',
            modalTitle  : 'JAVA',
            modalTextColor : '#E15462',
            modalWarning : 'Հարգելի դիմորդ տվյալ դասընթացին մասնակցելու և այն բարեհաջող' + '\n' +
            'ավարտելու համար անհրաժեշտ է ալգորիթմիկ մտածելակերպ,միջին մակարդակի անգլերենի իմացություն,' 
            + '\n' +
            'տեխնիկական կրթություն,մաթեմատիկական գիտելիքներ,C++ ծրագրավորման լեզվի իմացությունը կդիտվի' 
            + '\n' +
            'որպես առավելություն մյուս դիմորդների նկատմամբ,սիրով It-School:',
            title : 'Java',
            src : '../../../assets/Images/java-logo.jpg',
            bgColor : '#CCE5FF',
            buttonColor : 'rgb(64,224,208)',
            token : Math.floor(Math.random() * 100000),
            info : `Հարգելի դիմորդ դուք հաջողությամբ գրանցվել եք տվյալ դասընթացին:Դասընթացին ձեզ կտրվի 
            առանձին համակարգիչ և իհարկե անհատական մոտեցում ջերմ մթնոլորտում:Դասընթացի ավարտից հետո 
            ձեզ կտրվի սերտիֆիկատ A կամ B մակարդակի,ինչպես նաև անպայման կունենաք անվճար պրակտիկայի 
            հնարավորություն մեր հանրապետության առաջատար SS ընկերություններում,որից հետո կստանաք աշխատանքի
            առաջարկ,որպես Java developer:Մենք ապահովում ենք մեր ջանասեր ուսանողներին որակյալ կրթությամբ 
            և հուսալի ապագայով:Վարձավճարը կազմում է ամսեկան 60.000 դրամ:Դասընթացի տևողությունը
            5 ամիս:`,
            teacher : 'Արման Ադամյան,Java Developer EPAM-ում:',
            date : 'Դասընթացը կմեկնարկվի 1 ամսից.'
        }
    ];

    public searchArray : Array<any> = [
        ['angular','react.js','node.js','python','vue.js','java'],
        ['#angular','#react.js','#node.js','#python','#vue.js','#java']
    ];

    public lessonsArray : Array<any> = [
        
    ];
    
    constructor() { 
        
    }
}
